name: "huggingface-infer"
platform: "onnxruntime_onnx"
max_batch_size: 32
input [
  {
    name: "pixel_values"
    data_type: TYPE_FP32
    format: FORMAT_NCHW
    dims: [ 3, 224, 224 ]
  }
]
output [
  {
    name: "logits"
    data_type: TYPE_FP32
    dims: [ -1 ]
  }
]
version_policy: { all { }}